# 1. install bundle with brew: `$brew tap Homebrew/bundle`
# 2. Brew bundle: `$brew bundle` (must be run from same dir as file)
# or `brew bundle --file=~/.private/Brewfile`

tap "homebrew/cask"
brew "tree"
brew "mas"
brew "handbrake"
brew "neovim" # always neovim
brew "ack"
brew "profanity" # XMPP client
brew "lf"  # CLI file browser (gokcehan/lf/)
# brew "mutt" # CLI email cient (muttmua/mutt)
brew "diskonaut" # CLI disk usage visual treemap

cask "basictex"	# minimal Tex Distribution
# cask "mactex" # LaTeX Live distribution w GUI
# cask "tikzit"	# tikz drawing gui
tap "zegervdv/zathura"
#cask "zathura"
cask "pgadmin4" # pgsql database admin tool
cask "macsvg" 	# svg editor
cask "firefox"
cask "balenaetcher"	# burn iso to usb
# cask "karabiner-elements"
cask "telegram"
cask "shiftit"
cask "docker"
cask "vlc"
cask "disk-inventory-x"
cask "rekordbox"
cask "clickup"
cask "visual-studio-code"
cask "discord"
cask "qutebrowser"
cask "waterfox"
# cask "adium"
# # adium or pidgin?
# cask "pidgin"
# # Cask or brew install pidgin
# cask "fork"

# terminal
cask "alacritty"
# cask "iterm2"
