# 1. install bundle with brew: `$brew tap Homebrew/bundle`
# 2. Brew bundle: `$brew bundle` (must be run from same dir as file)
# or `brew bundle --file=~/.private/Brewfile`

tap "homebrew/cask"
brew "tree"
brew "mas"
brew "handbrake"
# brew "macvim"
brew "vim"
brew "ack"
brew "profanity" # XMPP client


cask "pgadmin4" # pgsql database admin tool
cask "macsvg"   # svg editor
cask "firefox"
cask "iterm2"
# cask "karabiner-elements"
cask "telegram"
cask "shiftit"
cask "docker"
cask "vlc"
cask "disk-inventory-x"
cask "rekordbox"
cask "clickup"
cask "visual-studio-code"
cask "discord"
# cask "adium"
# # adium or pidgin?
# cask "pidgin"
# # Cask or brew install pidgin
# cask "fork"
